ZhiKong0/nolebase-template/笔记/MCU_Learning/STM32学习/02进阶/PID算法/Project_Refactor_track-421 - 副本 (3)/User/main.c
#include "stm32f10x.h"
#include "config.h"
#include "pid_controller.h"
#include "motor_driver.h"
#include "sensor_fusion.h"
#include "bsp_uart.h"
#include "bsp_key.h"
#include "bsp_oled.h"
#include "Delay.h"
#include "line_track.h"
#include "stm32f10x_it.h"
#include <math.h>
#include <stdio.h>
#include <string.h>

static SystemState_t g_sysState = SYS_STOP;
static ControlMode_t g_mode = MODE_STRAIGHT;
static DualLoopState_t g_pid;
static Encoder_Data_t g_encoder;
static IMU_Data_t g_imu;

static volatile uint32_t g_tickMs = 0u;
static volatile uint8_t g_controlFlag = 0u;
static uint32_t g_runStartTick = 0u;
static uint32_t g_lastTelemetryTick = 0u;
static uint32_t g_lastControlTick = 0u;
static uint32_t g_lastImuTick = 0u;
static uint32_t g_lastDisplayTick = 0u;
static uint8_t g_displayDirty = 1u;
static float g_fastYawRate = 0.0f;
static uint32_t g_experimentId = 0u;
static uint8_t g_experimentActive = 0u;
static uint32_t g_experimentHostSyncUntilTick = 0u;

typedef enum
{
    EXP_TRIGGER_AUTO = 0,
    EXP_TRIGGER_KEY,
    EXP_TRIGGER_UART
} ExperimentTrigger_t;

typedef struct
{
    uint8_t active;
    uint8_t armed;
    uint8_t captureTicks;
    int8_t spinDir;
    uint32_t startTick;
    float startYaw;
    float prevYaw;
    float rotatedDeg;
    float targetYaw;
} TurnbackState_t;

static TurnbackState_t g_turnback;

static void Timer_Init(void)
{
    TIM_TimeBaseInitTypeDef tb;
    NVIC_InitTypeDef n;

    RCC_APB1PeriphClockCmd(SYS_TIM_RCC, ENABLE);

    tb.TIM_ClockDivision = TIM_CKD_DIV1;
    tb.TIM_CounterMode = TIM_CounterMode_Up;
    tb.TIM_Period = SYS_TIM_PERIOD - 1;
    tb.TIM_Prescaler = SYS_TIM_PRESCALER - 1;
    tb.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(SYS_TIM, &tb);

    TIM_ITConfig(SYS_TIM, TIM_IT_Update, ENABLE);
    TIM_ClearITPendingBit(SYS_TIM, TIM_IT_Update);

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    n.NVIC_IRQChannel = SYS_TIM_IRQn;
    n.NVIC_IRQChannelCmd = ENABLE;
    n.NVIC_IRQChannelPreemptionPriority = 2;
    n.NVIC_IRQChannelSubPriority = 0;
    NVIC_Init(&n);

    g_tickMs = 0u;
    TIM_Cmd(SYS_TIM, ENABLE);
}

void Main_TimerTickISR(void)
{
    static uint8_t divider = 0u;

    g_tickMs++;
    divider++;
    if (divider >= CONTROL_PERIOD_MS)
    {
        divider = 0u;
        g_controlFlag = 1u;
    }
    BspKey_Tick(g_tickMs);
}

static uint8_t is_running(void)
{
    return (g_sysState != SYS_STOP) ? 1u : 0u;
}

static uint8_t turnback_is_active(void)
{
    return g_turnback.active;
}

static uint8_t experiment_host_sync_active(void)
{
    return (g_experimentHostSyncUntilTick != 0u && g_tickMs < g_experimentHostSyncUntilTick) ? 1u : 0u;
}

static const char *experiment_trigger_str(ExperimentTrigger_t trigger)
{
    switch (trigger)
    {
    case EXP_TRIGGER_KEY:  return "KEY";
    case EXP_TRIGGER_UART: return "UART";
    default:               return "AUTO";
    }
}

static char mode_to_char(ControlMode_t mode)
{
    switch (mode)
    {
    case MODE_TRACK: return 'T';
    case MODE_SPIN:  return 'P';
    default:         return 'S';
    }
}

static void load_mode_defaults(ControlMode_t mode)
{
    if (mode == MODE_STRAIGHT)
    {
        DualLoop_LoadStraightDefaults(&g_pid);
    }
    else if (mode == MODE_TRACK)
    {
        DualLoop_LoadTrackDefaults(&g_pid);
    }
    else
    {
        DualLoop_LoadStraightDefaults(&g_pid);
        g_pid.targetSpeed = 0.0f;
    }
}

static void set_mode(ControlMode_t mode)
{
    g_mode = mode;
    load_mode_defaults(mode);
    g_displayDirty = 1u;
}

static void report_experiment_start(ExperimentTrigger_t trigger)
{
    char buf[80];

    sprintf(buf,
            "EVT:EXP_START,id=%lu,src=%s,mode=%c\r\n",
            (unsigned long)g_experimentId,
            experiment_trigger_str(trigger),
            mode_to_char(g_mode));
    BspUart_SendString(buf);
}

static void report_experiment_stop(ExperimentTrigger_t trigger, uint32_t durationMs)
{
    char buf[96];

    sprintf(buf,
            "EVT:EXP_STOP,id=%lu,src=%s,mode=%c,dur=%lu\r\n",
            (unsigned long)g_experimentId,
            experiment_trigger_str(trigger),
            mode_to_char(g_mode),
            (unsigned long)durationMs);
    BspUart_SendString(buf);
}

static void transition_start(ExperimentTrigger_t trigger)
{
    if (is_running() || turnback_is_active())
        return;

    if (experiment_host_sync_active())
        g_experimentId++;

    g_experimentActive = 1u;
    BNO085_ResetAttitude(&g_imu);
    memset(&g_encoder, 0, sizeof(g_encoder));
    Encoder_Reset();
    DualLoop_ResetAll(&g_pid);
    LineTrack_Stop();

    if (g_mode == MODE_STRAIGHT)
    {
        g_sysState = SYS_STRAIGHT;
        g_pid.speedRampTarget = SPEED_ENTRY;
    }
    else if (g_mode == MODE_TRACK)
    {
        g_sysState = SYS_TRACKING;
        g_pid.speedRampTarget = SPEED_ENTRY;
        LineTrack_Start(TRACK_DEFAULT_CROSSINGS);
    }
    else
    {
        g_sysState = SYS_SPINNING;
        g_pid.speedRampTarget = 0.0f;
    }

    g_pid.targetYaw = 0.0f;
    g_fastYawRate = 0.0f;
    g_runStartTick = g_tickMs;
    g_lastImuTick = g_tickMs;
    report_experiment_start(trigger);
    BspOled_ShowExperimentId(g_experimentId);
    MotorDriver_Enable();
    g_displayDirty = 1u;
}

static void transition_stop(ExperimentTrigger_t trigger)
{
    uint32_t durationMs = 0u;

    if (g_experimentActive)
    {
        durationMs = g_tickMs - g_runStartTick;
        report_experiment_stop(trigger, durationMs);
    }

    MotorDriver_Stop();
    MotorDriver_Disable();
    LineTrack_Stop();
    DualLoop_ResetAll(&g_pid);
    g_sysState = SYS_STOP;
    g_experimentActive = 0u;
    BspOled_ShowExperimentId(g_experimentId);
    g_displayDirty = 1u;
}

static void turnback_reset_state(void)
{
    memset(&g_turnback, 0, sizeof(g_turnback));
}

static uint8_t turnback_line_captured(const LineSensor_Data_t *line)
{
    return (line && line->lineDetected) ? 1u : 0u;
}

static void turnback_report(const char *tag, const LineSensor_Data_t *line)
{
    char buf[96];
    uint8_t bits = line ? line->bits : 0u;

    snprintf(buf, sizeof(buf),
             "EVT:TURNBACK,%s,deg=%.1f,sb=0x%02X\r\n",
             tag,
             (double)g_turnback.rotatedDeg,
             bits);
    BspUart_SendString(buf);
}

static void turnback_finish(const char *tag, const LineSensor_Data_t *line)
{
    MotorDriver_Stop();
    MotorDriver_Disable();
    turnback_report(tag, line);
    turnback_reset_state();
    g_displayDirty = 1u;
}

static void turnback_abort_silent(void)
{
    if (!turnback_is_active())
        return;

    MotorDriver_Stop();
    MotorDriver_Disable();
    turnback_reset_state();
    g_displayDirty = 1u;
}

static void turnback_start(void)
{
    float yawErr;

