ZhiKong0/nolebase-template/笔记/MCU_Learning/STM32学习/02进阶/PID算法/Project_Refactor_track-421 - 副本 (3)/User/main.c
    if (is_running())
    {
        BspUart_SendString("ERR:TURNBACK=RUNNING\r\n");
        return;
    }
    if (turnback_is_active())
    {
        BspUart_SendString("ERR:TURNBACK=BUSY\r\n");
        return;
    }

    turnback_reset_state();
    g_turnback.active = 1u;
    g_turnback.startTick = g_tickMs;
    g_turnback.startYaw = g_imu.yaw;
    g_turnback.prevYaw = g_imu.yaw;
    g_turnback.targetYaw = g_imu.yaw + TURNBACK_TARGET_DEG;
    while (g_turnback.targetYaw > 180.0f)
        g_turnback.targetYaw -= 360.0f;
    while (g_turnback.targetYaw < -180.0f)
        g_turnback.targetYaw += 360.0f;

    yawErr = BNO085_GetYawError(g_turnback.targetYaw, g_imu.yaw);
    g_turnback.spinDir = (yawErr >= 0.0f) ? 1 : -1;
    g_fastYawRate = 0.0f;
    MotorDriver_Enable();
    BspUart_SendString("OK:TURNBACK\r\n");
    BspUart_SendString("EVT:TURNBACK,START\r\n");
    g_displayDirty = 1u;
}

static void run_turnback(uint32_t now)
{
    LineSensor_Data_t line;
    float yawStep;
    float remainingDeg;
    int16_t spinPwm;

    if (!turnback_is_active())
        return;

    LineSensor_Read(&line);
    yawStep = fabsf(BNO085_GetYawError(g_imu.yaw, g_turnback.prevYaw));
    if (yawStep > 60.0f)
        yawStep = 0.0f;
    g_turnback.rotatedDeg += yawStep;
    g_turnback.prevYaw = g_imu.yaw;

    if ((now - g_turnback.startTick) >= TURNBACK_TIMEOUT_MS)
    {
        turnback_finish("FAIL", &line);
        return;
    }

    if (g_turnback.rotatedDeg >= (TURNBACK_TARGET_DEG - TURNBACK_ARM_ERR_DEG))
        g_turnback.armed = 1u;

    if (g_turnback.rotatedDeg >= (TURNBACK_TARGET_DEG + TURNBACK_OVERSHOOT_DEG))
    {
        turnback_finish("OVERSHOOT", &line);
        return;
    }

    if (g_turnback.armed && turnback_line_captured(&line))
    {
        if (g_turnback.captureTicks < 255u)
            g_turnback.captureTicks++;
    }
    else
    {
        g_turnback.captureTicks = 0u;
    }

    if (g_turnback.armed &&
        g_turnback.rotatedDeg >= (TURNBACK_TARGET_DEG - TURNBACK_STOP_ERR_DEG) &&
        g_turnback.captureTicks >= TURNBACK_CAPTURE_TICKS)
    {
        turnback_finish("DONE", &line);
        return;
    }

    remainingDeg = TURNBACK_TARGET_DEG - g_turnback.rotatedDeg;
    spinPwm = (remainingDeg > TURNBACK_ARM_ERR_DEG) ? TURNBACK_SPIN_PWM_FAST : TURNBACK_SPIN_PWM_SLOW;
    MotorDriver_Enable();
    MotorDriver_SetTurnPWM((int16_t)(spinPwm * g_turnback.spinDir),
                           (int16_t)(-spinPwm * g_turnback.spinDir));
}

static void transition_toggle_mode(void)
{
    if (is_running() || turnback_is_active())
        return;

    if (g_mode == MODE_STRAIGHT)
        set_mode(MODE_TRACK);
    else if (g_mode == MODE_TRACK)
        set_mode(MODE_SPIN);
    else
        set_mode(MODE_STRAIGHT);
}

static void process_key_event(void)
{
    KeyEvent_t evt = BspKey_Read();

    if (evt == KEY_EVENT_NONE)
        return;

    if (evt == KEY_EVENT_SHORT_PRESS)
    {
        if (turnback_is_active())
            turnback_abort_silent();
        else if (is_running())
            transition_stop(EXP_TRIGGER_KEY);
        else
            transition_start(EXP_TRIGGER_KEY);
    }
    else if (evt == KEY_EVENT_LONG_PRESS)
    {
        if (!is_running())
            transition_toggle_mode();
    }
}

static uint8_t cmd_parse_float(const char *s, float *out)
{
    const char *p = s;
    float value = 0.0f;
    float scale = 0.1f;
    uint8_t hasDigit = 0u;
    uint8_t neg = 0u;

    if (s == 0 || out == 0)
        return 0u;

    while (*p == ' ' || *p == '\t')
        p++;

    if (*p == '-' || *p == '+')
    {
        neg = (*p == '-') ? 1u : 0u;
        p++;
    }

    while (*p >= '0' && *p <= '9')
    {
        value = value * 10.0f + (float)(*p - '0');
        hasDigit = 1u;
        p++;
    }

    if (*p == '.')
    {
        p++;
        while (*p >= '0' && *p <= '9')
        {
            value += (float)(*p - '0') * scale;
            scale *= 0.1f;
            hasDigit = 1u;
            p++;
        }
    }

    while (*p == ' ' || *p == '\t')
        p++;

    if (!hasDigit)
        return 0u;
    if (*p != '\0' && *p != '!' && *p != '\r' && *p != '\n')
        return 0u;

    *out = neg ? -value : value;
    return 1u;
}

static uint8_t cmd_parse_u32(const char *s, uint32_t *out)
{
    uint32_t value = 0u;
    uint8_t digits = 0u;
    const char *p = s;

    if (*p == '+')
        p++;

    while (*p >= '0' && *p <= '9')
    {
        value = (value * 10u) + (uint32_t)(*p - '0');
        digits = 1u;
        p++;
    }

    if (!digits)
        return 0u;
    if (*p != '\0' && *p != '!')
        return 0u;

    *out = value;
    return 1u;
}

static void send_experiment_id_response(void)
{
    char buf[32];

    sprintf(buf, "OK:EXP=%lu\r\n", (unsigned long)g_experimentId);
    BspUart_SendString(buf);
}

static void sync_experiment_id(uint32_t experimentId)
{
    g_experimentId = experimentId;
    BspOled_ShowExperimentId(g_experimentId);
    g_displayDirty = 1u;
}

static uint8_t cmd_copy_token(const char *src, char *out, uint8_t outSize, const char **next)
{
    uint8_t len = 0u;

    if (src == 0 || out == 0 || outSize == 0u)
        return 0u;

    while (*src == ' ')
        src++;

    while (*src != '\0' && *src != ' ' && *src != '!' && len < (uint8_t)(outSize - 1u))
    {
        out[len++] = *src++;
    }
    out[len] = '\0';

    while (*src == ' ')
        src++;

    if (next != 0)
        *next = src;
    return (len > 0u) ? 1u : 0u;
}

static void handle_tcfg_command(const char *cmd)
{
    char key[40];
    char listBuf[512];
    const char *payload;
    const char *next;
    float fval;
    float applied;

    if (strcmp(cmd, "#TCFG PING!") == 0)
    {
        BspUart_SendString("OK:TCFG PING\r\n");
        return;
    }

    if (strcmp(cmd, "#TCFG LIST!") == 0)
    {
        LineTrack_ParamList(listBuf, (uint16_t)sizeof(listBuf));
        {
            char out[640];
            snprintf(out, sizeof(out), "OK:TCFG LIST track.speed_target,%s\r\n", listBuf);
            BspUart_SendString(out);
        }
        return;
    }

    if (strcmp(cmd, "#TCFG LOAD_DEFAULTS!") == 0)
    {
        g_pid.targetSpeed = PID_TRACK_SPEED_TARGET;
        LineTrack_SetPID(PID_TRACK_LINE_KP, PID_TRACK_LINE_KD);
        LineTrack_ResetRuntimeConfig();
        BspUart_SendString("OK:TCFG LOAD_DEFAULTS\r\n");
        return;
    }

