ZhiKong0/nolebase-template/笔记/MCU_Learning/STM32学习/02进阶/PID算法/Project_Refactor_track-421 - 副本 (3)/User/main.c
    if (strncmp(cmd, "#TCFG GET ", 10) == 0)
    {
        char out[128];
        payload = cmd + 10;
        if (!cmd_copy_token(payload, key, (uint8_t)sizeof(key), 0))
        {
            BspUart_SendString("ERR:TCFG GET\r\n");
            return;
        }

        if (strcmp(key, "track.speed_target") == 0)
        {
            snprintf(out, sizeof(out), "OK:TCFG GET %s=%.3f\r\n", key, (double)g_pid.targetSpeed);
            BspUart_SendString(out);
            return;
        }

        if (LineTrack_ParamGet(key, &fval))
        {
            snprintf(out, sizeof(out), "OK:TCFG GET %s=%.3f\r\n", key, (double)fval);
            BspUart_SendString(out);
            return;
        }

        BspUart_SendString("ERR:TCFG GET\r\n");
        return;
    }

    if (strncmp(cmd, "#TCFG SET ", 10) == 0)
    {
        char out[144];
        payload = cmd + 10;
        if (!cmd_copy_token(payload, key, (uint8_t)sizeof(key), &next))
        {
            BspUart_SendString("ERR:TCFG SET\r\n");
            return;
        }
        if (!cmd_parse_float(next, &fval))
        {
            BspUart_SendString("ERR:TCFG SET\r\n");
            return;
        }

        if (strcmp(key, "track.speed_target") == 0)
        {
            g_pid.targetSpeed = fval;
            snprintf(out, sizeof(out), "OK:TCFG SET %s=%.3f\r\n", key, (double)g_pid.targetSpeed);
            BspUart_SendString(out);
            return;
        }

        if (LineTrack_ParamSet(key, fval, &applied))
        {
            snprintf(out, sizeof(out), "OK:TCFG SET %s=%.3f\r\n", key, (double)applied);
            BspUart_SendString(out);
            return;
        }

        BspUart_SendString("ERR:TCFG SET\r\n");
        return;
    }

    BspUart_SendString("ERR:TCFG\r\n");
}

static uint8_t handle_sensor_scale_command(const char *cmd)
{
    uint8_t sensorIndex;
    float fval;
    float applied;
    char key[24];
    char out[40];

    if (cmd == 0 || cmd[0] != '#' || cmd[1] != 'T' || cmd[2] != 'S')
        return 0u;
    if (cmd[3] < '1' || cmd[3] > '8')
        return 0u;

    sensorIndex = (uint8_t)(cmd[3] - '0');
    snprintf(key, sizeof(key), "track.sensor_scale%u", (unsigned)sensorIndex);

    if (strcmp(cmd + 4, "?!") == 0)
    {
        if (LineTrack_ParamGet(key, &fval))
        {
            int16_t milli = (int16_t)(fval * 1000.0f + 0.5f);
            snprintf(out, sizeof(out), "OK:TS%u=%d\r\n", (unsigned)sensorIndex, (int)milli);
            BspUart_SendString(out);
        }
        else
        {
            BspUart_SendString("ERR:TS\r\n");
        }
        return 1u;
    }

    if (cmd[4] == '=' && cmd_parse_float(cmd + 5, &fval))
    {
        if (fval > 10.0f || fval < -10.0f)
            fval *= 0.001f;
        if (LineTrack_ParamSet(key, fval, &applied))
        {
            int16_t milli = (int16_t)(applied * 1000.0f + 0.5f);
            snprintf(out, sizeof(out), "OK:TS%u=%d\r\n", (unsigned)sensorIndex, (int)milli);
            BspUart_SendString(out);
        }
        else
        {
            BspUart_SendString("ERR:TS\r\n");
        }
        return 1u;
    }

    return 0u;
}

static uint8_t handle_track_short_param_command(const char *cmd, const char *tag, const char *key)
{
    float fval;
    float applied;
    char out[40];
    size_t tagLen;

    if (cmd == 0 || tag == 0 || key == 0)
        return 0u;

    tagLen = strlen(tag);
    if (strncmp(cmd, tag, tagLen) != 0)
        return 0u;

    if (strcmp(cmd + tagLen, "?!") == 0)
    {
        if (LineTrack_ParamGet(key, &fval))
        {
            snprintf(out, sizeof(out), "OK:%s=%.3f\r\n", tag + 1, (double)fval);
            BspUart_SendString(out);
        }
        else
        {
            snprintf(out, sizeof(out), "ERR:%s\r\n", tag + 1);
            BspUart_SendString(out);
        }
        return 1u;
    }

    if (cmd[tagLen] == '=' && cmd_parse_float(cmd + tagLen + 1u, &fval))
    {
        if (LineTrack_ParamSet(key, fval, &applied))
        {
            snprintf(out, sizeof(out), "OK:%s=%.3f\r\n", tag + 1, (double)applied);
            BspUart_SendString(out);
        }
        else
        {
            snprintf(out, sizeof(out), "ERR:%s\r\n", tag + 1);
            BspUart_SendString(out);
        }
        return 1u;
    }

    return 0u;
}

static void handle_command(const char *cmd)
{
    float fval;
    uint32_t u32val;

    if (strcmp(cmd, "#RUN!") == 0)
    {
        transition_start(EXP_TRIGGER_UART);
        BspUart_SendString("OK:RUN\r\n");
        return;
    }
    if (strcmp(cmd, "#STOP!") == 0)
    {
        turnback_abort_silent();
        transition_stop(EXP_TRIGGER_UART);
        BspUart_SendString("OK:STOP\r\n");
        return;
    }
    if (strcmp(cmd, "#TURNBACK!") == 0)
    {
        turnback_start();
        return;
    }
    if (strcmp(cmd, "#EXP?!") == 0)
    {
        send_experiment_id_response();
        return;
    }
    if (strcmp(cmd, "#EXPHOST=OFF!") == 0)
    {
        g_experimentHostSyncUntilTick = 0u;
        BspUart_SendString("OK:EXPHOST=OFF\r\n");
        return;
    }
    if (strncmp(cmd, "#EXPHOST=", 9) == 0)
    {
        if (cmd_parse_u32(cmd + 9, &u32val))
        {
            g_experimentHostSyncUntilTick = g_tickMs + EXP_HOST_SYNC_TIMEOUT_MS;
            if (!is_running() && g_experimentId < u32val)
                sync_experiment_id(u32val);
        }
        return;
    }
    if (strncmp(cmd, "#EXP=", 5) == 0)
    {
        if (!is_running() && cmd_parse_u32(cmd + 5, &u32val))
        {
            sync_experiment_id(u32val);
            send_experiment_id_response();
        }
        else if (is_running())
        {
            BspUart_SendString("ERR:EXP=RUNNING\r\n");
        }
        return;
    }
    if (strcmp(cmd, "#MODE=STRAIGHT!") == 0)
    {
        if (!is_running() && !turnback_is_active())
        {
            set_mode(MODE_STRAIGHT);
            BspUart_SendString("OK:MODE=STRAIGHT\r\n");
        }
        return;
    }
    if (strcmp(cmd, "#MODE=TRACK!") == 0)
    {
        if (!is_running() && !turnback_is_active())
        {
            set_mode(MODE_TRACK);
            BspUart_SendString("OK:MODE=TRACK\r\n");
        }
        return;
    }
    if (strcmp(cmd, "#MODE=SPIN!") == 0)
    {
        if (!is_running() && !turnback_is_active())
        {
            set_mode(MODE_SPIN);
            BspUart_SendString("OK:MODE=SPIN\r\n");
        }
        return;
    }
    if (handle_sensor_scale_command(cmd))
    {
        return;
    }
    if (handle_track_short_param_command(cmd, "#CSR", "track.center_dev_ratio")) return;
    if (handle_track_short_param_command(cmd, "#CSM", "track.center_kp_scale")) return;
    if (handle_track_short_param_command(cmd, "#CMR", "track.mid_dev_ratio")) return;
    if (handle_track_short_param_command(cmd, "#CMM", "track.mid_kp_scale")) return;
    if (handle_track_short_param_command(cmd, "#EDR", "track.edge_dev_ratio")) return;
    if (handle_track_short_param_command(cmd, "#EDM", "track.edge_kp_scale")) return;
    if (handle_track_short_param_command(cmd, "#RCD", "track.recenter_decay")) return;
    if (handle_track_short_param_command(cmd, "#STB", "track.static_bias")) return;
    if (handle_track_short_param_command(cmd, "#CDB", "track.center_deadband")) return;
    if (handle_track_short_param_command(cmd, "#PLF", "track.pos_lpf")) return;
    if (handle_track_short_param_command(cmd, "#DLF", "track.d_lpf")) return;
    if (handle_track_short_param_command(cmd, "#OCB", "track.offcenter_boost")) return;
    if (handle_track_short_param_command(cmd, "#CHT", "track.center_hold_ticks")) return;
    if (handle_track_short_param_command(cmd, "#RCT", "track.recover_ticks")) return;
    if (handle_track_short_param_command(cmd, "#STF", "track.search_turn_fast")) return;
    if (handle_track_short_param_command(cmd, "#STS", "track.search_turn_slow")) return;
    if (handle_track_short_param_command(cmd, "#STO", "track.search_timeout")) return;
    if (strncmp(cmd, "#TCFG ", 6) == 0)
    {
        handle_tcfg_command(cmd);
        return;
    }
    if (strncmp(cmd, "#SPD=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            g_pid.targetSpeed = fval;
            BspUart_SendString("OK:SPD\r\n");
        }
        return;
    }
    if (strncmp(cmd, "#SKP=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            g_pid.speedPID.kp = fval;
            BspUart_SendString("OK:SKP\r\n");
        }
        return;
    }
    if (strncmp(cmd, "#SKI=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            g_pid.speedPID.ki = fval;
            BspUart_SendString("OK:SKI\r\n");
        }
        return;
    }
    if (strncmp(cmd, "#SKD=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            g_pid.speedPID.kd = fval;
            BspUart_SendString("OK:SKD\r\n");
        }
        return;
    }
    if (strncmp(cmd, "#AKP=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            g_pid.headingPID.kp = fval;
            BspUart_SendString("OK:AKP\r\n");
        }
        return;
    }
    if (strncmp(cmd, "#AKI=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            g_pid.headingPID.ki = fval;
            BspUart_SendString("OK:AKI\r\n");
        }
        return;
    }
    if (strncmp(cmd, "#AKD=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            g_pid.headingPID.kd = fval;
            BspUart_SendString("OK:AKD\r\n");
        }
        return;
    }
    if (strncmp(cmd, "#LKP=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            LineTrack_SetPID(fval, g_lineTrack.kd);
            BspUart_SendString("OK:LKP\r\n");
        }
        return;
    }
    if (strcmp(cmd, "#LKP?!") == 0)
    {
        char out[40];
        snprintf(out, sizeof(out), "OK:LKP=%.3f\r\n", (double)g_lineTrack.kp);
        BspUart_SendString(out);
        return;
    }
    if (strncmp(cmd, "#LKD=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            LineTrack_SetPID(g_lineTrack.kp, fval);
            BspUart_SendString("OK:LKD\r\n");
        }
        return;
    }
    if (strcmp(cmd, "#LKD?!") == 0)
    {
        char out[40];
        snprintf(out, sizeof(out), "OK:LKD=%.3f\r\n", (double)g_lineTrack.kd);
        BspUart_SendString(out);
        return;
    }
    if (strncmp(cmd, "#SFF=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            g_pid.feedforwardGain = fval;
            BspUart_SendString("OK:SFF\r\n");
        }
        return;
    }
    if (strncmp(cmd, "#HTR=", 5) == 0)
    {
        if (cmd_parse_float(cmd + 5, &fval))
        {
            g_pid.headingTrim = fval;
            BspUart_SendString("OK:HTR\r\n");
        }
        return;
    }
    if (strcmp(cmd, "#STAT!") == 0)
    {
        BspUart_SendStat(g_sysState, g_mode,
                         g_pid.speedPID.kp, g_pid.speedPID.ki, g_pid.speedPID.kd,
                         g_pid.headingPID.kp, g_pid.headingPID.ki, g_pid.headingPID.kd,
                         g_lineTrack.kp, 0.0f, g_lineTrack.kd,
                         g_pid.targetSpeed);
        return;
    }
    if (strcmp(cmd, "#CAL!") == 0)
    {
        BspUart_SendString("OK:CAL\r\n");
        return;
    }

    BspUart_SendString("ERR\r\n");
}

static void run_control(uint32_t now)
{
    float dt;
    float avgSpeed;
    float dtNorm;

    dt = (float)(now - g_lastControlTick) * 0.001f;
    if (dt <= 0.0f)
        dt = 0.01f;
    if (dt > 0.5f)
        dt = 0.5f;
    g_lastControlTick = now;

    Encoder_Update(&g_encoder);

