ZhiKong0/nolebase-template/笔记/MCU_Learning/STM32学习/02进阶/PID算法/Project_Refactor_track-421 - 副本 (3)/User/main.c
    dtNorm = dt * 100.0f;
    if (dtNorm < 0.5f)
        dtNorm = 0.5f;

    {
        float nl = (float)g_encoder.leftSpeed / dtNorm;
        float nr = (float)g_encoder.rightSpeed / dtNorm;
        g_encoder.filteredLeftSpeed = ENC_SPEED_LPF_ALPHA * nl + (1.0f - ENC_SPEED_LPF_ALPHA) * g_encoder.filteredLeftSpeed;
        g_encoder.filteredRightSpeed = ENC_SPEED_LPF_ALPHA * nr + (1.0f - ENC_SPEED_LPF_ALPHA) * g_encoder.filteredRightSpeed;
    }

    if (turnback_is_active())
    {
        run_turnback(now);
        g_pid.leftPWM = MotorDriver_GetActualL();
        g_pid.rightPWM = MotorDriver_GetActualR();
        return;
    }

    if (!is_running())
        return;

    if (g_sysState == SYS_STRAIGHT)
    {
        avgSpeed = (g_encoder.filteredLeftSpeed + g_encoder.filteredRightSpeed) * 0.5f;
        DualLoop_ComputeStraight(&g_pid, avgSpeed, g_imu.yaw, g_imu.yawRate, g_fastYawRate, dt);
        MotorDriver_SetCoreDiff(g_pid.pwmCore, g_pid.headingDiffPWM);
        g_pid.leftPWM = MotorDriver_GetActualL();
        g_pid.rightPWM = MotorDriver_GetActualR();
    }
    else if (g_sysState == SYS_TRACKING)
    {
        avgSpeed = (g_encoder.filteredLeftSpeed + g_encoder.filteredRightSpeed) * 0.5f;
        DualLoop_ComputeSpeed(&g_pid, avgSpeed, dt);
        LineTrack_Update(now, g_pid.pwmCore, g_imu.yaw);

        if (g_lineTrack.cornerDone)
        {
            float resumeSpeedTarget;

            g_lineTrack.cornerDone = 0u;
            PID_Reset(&g_pid.speedPID);
            resumeSpeedTarget = g_pid.currentSpeed;
            if (resumeSpeedTarget < SPEED_ENTRY)
                resumeSpeedTarget = SPEED_ENTRY;
            if (resumeSpeedTarget > TRACK_RESUME_SPEED_MAX)
                resumeSpeedTarget = TRACK_RESUME_SPEED_MAX;
            if (resumeSpeedTarget > g_pid.targetSpeed)
                resumeSpeedTarget = g_pid.targetSpeed;
            g_pid.speedRampTarget = resumeSpeedTarget;
        }

        g_pid.leftPWM = MotorDriver_GetActualL();
        g_pid.rightPWM = MotorDriver_GetActualR();

        if (!LineTrack_IsRunning())
            transition_stop(EXP_TRIGGER_AUTO);
    }
    else if (g_sysState == SYS_SPINNING)
    {
        g_pid.pwmCore = 0;
        g_pid.headingDiffPWM = 0;

#if SPIN_PLACEHOLDER_PWM > 0
        MotorDriver_Enable();
        MotorDriver_SetTurnPWM(SPIN_PLACEHOLDER_PWM, (int16_t)(-SPIN_PLACEHOLDER_PWM));
#else
        MotorDriver_Enable();
        MotorDriver_SetTurnPWM(0, 0);
#endif
        g_pid.leftPWM = MotorDriver_GetActualL();
        g_pid.rightPWM = MotorDriver_GetActualR();
    }
}

static void run_imu_update(void)
{
    float dt;
    uint32_t now = g_tickMs;

    dt = (float)(now - g_lastImuTick) * 0.001f;
    if (dt <= 0.0f || dt > 0.5f)
        dt = 0.2f;

    BNO085_ReadAll(&g_imu);
    BNO085_UpdateYaw(&g_imu, dt);
    g_fastYawRate += 0.5f * (-g_imu.gyroZf - g_fastYawRate);
    g_lastImuTick = g_tickMs;
}

static void send_telemetry(void)
{
    uint32_t t = turnback_is_active() ? (g_tickMs - g_turnback.startTick) : (g_tickMs - g_runStartTick);
    uint8_t run = is_running();

    if (turnback_is_active())
    {
        BspUart_SendTelemetrySpin(t, g_experimentId, 0u,
                                  g_encoder.leftSpeed, g_encoder.rightSpeed,
                                  g_imu.yaw, g_fastYawRate,
                                  g_pid.leftPWM, g_pid.rightPWM);
    }
    else if (g_sysState == SYS_TRACKING)
    {
        BspUart_SendTelemetryTrack(t, g_experimentId, run,
                                   g_encoder.leftSpeed, g_encoder.rightSpeed,
                                   g_imu.yaw, g_imu.yawRate,
                                   g_pid.pwmCore, g_lineTrack.devSpeed,
                                   g_pid.leftPWM, g_pid.rightPWM,
                                   g_lineTrack.sensorData, g_lineTrack.linePos,
                                   g_lineTrack.bearingDev, g_lineTrack.crossCount,
                                   g_lineTrack.dbgTrackState, g_lineTrack.dbgTurnDir,
                                   g_lineTrack.dbgCrossActive,
                                   g_lineTrack.dbgTelemState, g_lineTrack.dbgTelemFlags,
                                   g_lineTrack.gainStage, g_lineTrack.searchPhase,
                                   g_lineTrack.recoverTicks);
    }
    else if (g_sysState == SYS_SPINNING)
    {
        BspUart_SendTelemetrySpin(t, g_experimentId, run,
                                  g_encoder.leftSpeed, g_encoder.rightSpeed,
                                  g_imu.yaw, g_fastYawRate,
                                  g_pid.leftPWM, g_pid.rightPWM);
    }
    else
    {
        BspUart_SendTelemetryStraight(t, g_experimentId, run,
                                      g_encoder.leftSpeed, g_encoder.rightSpeed,
                                      g_imu.yaw, g_fastYawRate,
                                      g_pid.pwmCore, g_pid.headingDiffPWM,
                                      g_pid.dTermPostDZ,
                                      g_pid.leftPWM, g_pid.rightPWM,
                                      g_pid.lastHi);
    }
}

static void update_display(uint32_t now)
{
    if (is_running() || turnback_is_active())
        return;

    if (!g_displayDirty && (now - g_lastDisplayTick) < 200u)
        return;

    g_lastDisplayTick = now;
    g_displayDirty = 0u;

    BspOled_ShowStatus(g_sysState, g_mode,
                       g_imu.yaw,
                       (float)g_encoder.leftSpeed,
                       (float)g_encoder.rightSpeed,
                       g_experimentId);
}

int main(void)
{
    char cmdBuf[64];
    uint32_t now;
    uint32_t telemetryPeriod;

    BspOled_Init();
    BspKey_Init();
    BspUart_Init();
    BspOled_ShowFaultCode(FaultTrace_GetAndClearCode());

    Timer_Init();
    BspOled_ShowIMUInit(BNO085_GetInitStage(), BNO085_GetI2CAddr());

    MotorDriver_Init();
    Encoder_Init();
    BNO085_Init();
    BspOled_ShowIMUInit(BNO085_GetInitStage(), BNO085_GetI2CAddr());
    LineSensor_Init();

    DualLoop_Init(&g_pid);
    LineTrack_Init();
    memset(&g_encoder, 0, sizeof(g_encoder));
    memset(&g_imu, 0, sizeof(g_imu));

    g_displayDirty = 1u;

    while (1)
    {
        now = g_tickMs;

        if (BspUart_TakeCommand(cmdBuf, sizeof(cmdBuf)))
            handle_command(cmdBuf);

        if ((now - g_lastImuTick) >= IMU_READ_PERIOD_MS)
            run_imu_update();

        if (g_controlFlag)
        {
            g_controlFlag = 0u;
            run_control(now);
        }

        telemetryPeriod = is_running() ? TELEMETRY_PERIOD_MS : TELEMETRY_IDLE_PERIOD_MS;
        if ((now - g_lastTelemetryTick) >= telemetryPeriod)
        {
            g_lastTelemetryTick = now;
            send_telemetry();
        }

        update_display(now);
        process_key_event();
    }
}
